susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32L41x.h
/*
  * This file is automatically generated by afTable.py from the xml descriptions provided as part of the STM32Cube IDE
*/

#ifndef LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION
#define LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION

#define COMP1_OUT_PA0_ PA0,GPIO_AF12
#define COMP1_OUT_PA0_ PA0,GPIO_AF12
#define COMP1_OUT_PA11_ PA11,GPIO_AF6
#define COMP1_OUT_PA6_ PA6,GPIO_AF6
#define COMP1_OUT_PB0_ PB0,GPIO_AF12
#define COMP1_OUT_PB10_ PB10,GPIO_AF12
#define _COMP1_OUT_PA0_ 1
#define _COMP1_OUT_PA0_ 1
#define _COMP1_OUT_PA11_ 1
#define _COMP1_OUT_PA6_ 1
#define _COMP1_OUT_PB0_ 1
#define _COMP1_OUT_PB10_ 1

#define CRS_SYNC_PA10_ PA10,GPIO_AF10
#define _CRS_SYNC_PA10_ 1

#define EVENTOUT_PA0_ PA0,GPIO_AF15
#define EVENTOUT_PA0_ PA0,GPIO_AF15
#define EVENTOUT_PA1_ PA1,GPIO_AF15
#define EVENTOUT_PA10_ PA10,GPIO_AF15
#define EVENTOUT_PA11_ PA11,GPIO_AF15
#define EVENTOUT_PA12_ PA12,GPIO_AF15
#define EVENTOUT_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF15
#define EVENTOUT_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF15
#define EVENTOUT_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF15
#define EVENTOUT_PA2_ PA2,GPIO_AF15
#define EVENTOUT_PA3_ PA3,GPIO_AF15
#define EVENTOUT_PA4_ PA4,GPIO_AF15
#define EVENTOUT_PA5_ PA5,GPIO_AF15
#define EVENTOUT_PA6_ PA6,GPIO_AF15
#define EVENTOUT_PA7_ PA7,GPIO_AF15
#define EVENTOUT_PA8_ PA8,GPIO_AF15
#define EVENTOUT_PA9_ PA9,GPIO_AF15
#define EVENTOUT_PB0_ PB0,GPIO_AF15
#define EVENTOUT_PB1_ PB1,GPIO_AF15
#define EVENTOUT_PB10_ PB10,GPIO_AF15
#define EVENTOUT_PB11_ PB11,GPIO_AF15
#define EVENTOUT_PB12_ PB12,GPIO_AF15
#define EVENTOUT_PB13_ PB13,GPIO_AF15
#define EVENTOUT_PB14_ PB14,GPIO_AF15
#define EVENTOUT_PB15_ PB15,GPIO_AF15
#define EVENTOUT_PB2_ PB2,GPIO_AF15
#define EVENTOUT_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF15
#define EVENTOUT_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF15
#define EVENTOUT_PB5_ PB5,GPIO_AF15
#define EVENTOUT_PB6_ PB6,GPIO_AF15
#define EVENTOUT_PB7_ PB7,GPIO_AF15
#define EVENTOUT_PB8_ PB8,GPIO_AF15
#define EVENTOUT_PB9_ PB9,GPIO_AF15
#define EVENTOUT_PC0_ PC0,GPIO_AF15
#define EVENTOUT_PC1_ PC1,GPIO_AF15
#define EVENTOUT_PC10_ PC10,GPIO_AF15
#define EVENTOUT_PC11_ PC11,GPIO_AF15
#define EVENTOUT_PC12_ PC12,GPIO_AF15
#define EVENTOUT_PC13_ PC13,GPIO_AF15
#define EVENTOUT_PC14_ PC14,GPIO_AF15
#define EVENTOUT_PC15_ PC15,GPIO_AF15
#define EVENTOUT_PC2_ PC2,GPIO_AF15
#define EVENTOUT_PC3_ PC3,GPIO_AF15
#define EVENTOUT_PC4_ PC4,GPIO_AF15
#define EVENTOUT_PC5_ PC5,GPIO_AF15
#define EVENTOUT_PC6_ PC6,GPIO_AF15
#define EVENTOUT_PC7_ PC7,GPIO_AF15
#define EVENTOUT_PC8_ PC8,GPIO_AF15
#define EVENTOUT_PC9_ PC9,GPIO_AF15
#define EVENTOUT_PD2_ PD2,GPIO_AF15
#define EVENTOUT_PH0_ PH0,GPIO_AF15
#define EVENTOUT_PH1_ PH1,GPIO_AF15
#define EVENTOUT_PH3_ PH3,GPIO_AF15
#define _EVENTOUT_PA0_ 1
#define _EVENTOUT_PA0_ 1
#define _EVENTOUT_PA1_ 1
#define _EVENTOUT_PA10_ 1
#define _EVENTOUT_PA11_ 1
#define _EVENTOUT_PA12_ 1
#define _EVENTOUT_PA13 (JTMS/SWDIO)_ 1
#define _EVENTOUT_PA14 (JTCK/SWCLK)_ 1
#define _EVENTOUT_PA15 (JTDI)_ 1
#define _EVENTOUT_PA2_ 1
#define _EVENTOUT_PA3_ 1
#define _EVENTOUT_PA4_ 1
#define _EVENTOUT_PA5_ 1
#define _EVENTOUT_PA6_ 1
#define _EVENTOUT_PA7_ 1
#define _EVENTOUT_PA8_ 1
#define _EVENTOUT_PA9_ 1
#define _EVENTOUT_PB0_ 1
#define _EVENTOUT_PB1_ 1
#define _EVENTOUT_PB10_ 1
#define _EVENTOUT_PB11_ 1
#define _EVENTOUT_PB12_ 1
#define _EVENTOUT_PB13_ 1
#define _EVENTOUT_PB14_ 1
#define _EVENTOUT_PB15_ 1
#define _EVENTOUT_PB2_ 1
#define _EVENTOUT_PB3 (JTDO/TRACESWO)_ 1
#define _EVENTOUT_PB4 (NJTRST)_ 1
#define _EVENTOUT_PB5_ 1
#define _EVENTOUT_PB6_ 1
#define _EVENTOUT_PB7_ 1
#define _EVENTOUT_PB8_ 1
#define _EVENTOUT_PB9_ 1
#define _EVENTOUT_PC0_ 1
#define _EVENTOUT_PC1_ 1
#define _EVENTOUT_PC10_ 1
#define _EVENTOUT_PC11_ 1
#define _EVENTOUT_PC12_ 1
#define _EVENTOUT_PC13_ 1
#define _EVENTOUT_PC14_ 1
#define _EVENTOUT_PC15_ 1
#define _EVENTOUT_PC2_ 1
#define _EVENTOUT_PC3_ 1
#define _EVENTOUT_PC4_ 1
#define _EVENTOUT_PC5_ 1
#define _EVENTOUT_PC6_ 1
#define _EVENTOUT_PC7_ 1
#define _EVENTOUT_PC8_ 1
#define _EVENTOUT_PC9_ 1
#define _EVENTOUT_PD2_ 1
#define _EVENTOUT_PH0_ 1
#define _EVENTOUT_PH1_ 1
#define _EVENTOUT_PH3_ 1

#define I2C1_SCL_PA9_ PA9,GPIO_AF4
#define I2C1_SCL_PB6_ PB6,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PA9_ 1
#define _I2C1_SCL_PB6_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PA10_ PA10,GPIO_AF4
#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PA10_ 1
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PA1_ PA1,GPIO_AF4
#define I2C1_SMBA_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF4
#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PA1_ 1
#define _I2C1_SMBA_PA14 (JTCK/SWCLK)_ 1
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PB10_ PB10,GPIO_AF4
#define I2C2_SCL_PB13_ PB13,GPIO_AF4
#define _I2C2_SCL_PB10_ 1
#define _I2C2_SCL_PB13_ 1

#define I2C2_SDA_PB11_ PB11,GPIO_AF4
#define I2C2_SDA_PB14_ PB14,GPIO_AF4
#define _I2C2_SDA_PB11_ 1
#define _I2C2_SDA_PB14_ 1

#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define _I2C2_SMBA_PB12_ 1

#define I2C3_SCL_PA7_ PA7,GPIO_AF4
#define I2C3_SCL_PC0_ PC0,GPIO_AF4
#define _I2C3_SCL_PA7_ 1
#define _I2C3_SCL_PC0_ 1

#define I2C3_SDA_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF4
#define I2C3_SDA_PC1_ PC1,GPIO_AF4
#define _I2C3_SDA_PB4 (NJTRST)_ 1
#define _I2C3_SDA_PC1_ 1

#define I2C3_SMBA_PB2_ PB2,GPIO_AF4
#define _I2C3_SMBA_PB2_ 1

#define IR_OUT_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF1
#define IR_OUT_PB9_ PB9,GPIO_AF1
#define _IR_OUT_PA13 (JTMS/SWDIO)_ 1
#define _IR_OUT_PB9_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF1
#define LPTIM1_ETR_PC3_ PC3,GPIO_AF1
#define _LPTIM1_ETR_PB6_ 1
#define _LPTIM1_ETR_PC3_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF1
#define LPTIM1_IN1_PC0_ PC0,GPIO_AF1
#define _LPTIM1_IN1_PB5_ 1
#define _LPTIM1_IN1_PC0_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF1
#define LPTIM1_IN2_PC2_ PC2,GPIO_AF1
#define _LPTIM1_IN2_PB7_ 1
#define _LPTIM1_IN2_PC2_ 1

#define LPTIM1_OUT_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF1
#define LPTIM1_OUT_PB2_ PB2,GPIO_AF1
#define LPTIM1_OUT_PC1_ PC1,GPIO_AF1
#define _LPTIM1_OUT_PA14 (JTCK/SWCLK)_ 1
#define _LPTIM1_OUT_PB2_ 1
#define _LPTIM1_OUT_PC1_ 1

#define LPTIM2_ETR_PA5_ PA5,GPIO_AF14
#define LPTIM2_ETR_PC3_ PC3,GPIO_AF14
#define _LPTIM2_ETR_PA5_ 1
#define _LPTIM2_ETR_PC3_ 1

#define LPTIM2_IN1_PB1_ PB1,GPIO_AF14
#define LPTIM2_IN1_PC0_ PC0,GPIO_AF14
#define _LPTIM2_IN1_PB1_ 1
#define _LPTIM2_IN1_PC0_ 1

#define LPTIM2_OUT_PA4_ PA4,GPIO_AF14
#define LPTIM2_OUT_PA8_ PA8,GPIO_AF14
#define _LPTIM2_OUT_PA4_ 1
#define _LPTIM2_OUT_PA8_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF8
#define LPUART1_CTS_PB13_ PB13,GPIO_AF8
#define _LPUART1_CTS_PA6_ 1
#define _LPUART1_CTS_PB13_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF8
#define LPUART1_DE_PB12_ PB12,GPIO_AF8
#define _LPUART1_DE_PB1_ 1
#define _LPUART1_DE_PB12_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF8
#define LPUART1_RTS_PB12_ PB12,GPIO_AF8
#define _LPUART1_RTS_PB1_ 1
#define _LPUART1_RTS_PB12_ 1

#define LPUART1_RX_PA3_ PA3,GPIO_AF8
#define LPUART1_RX_PB10_ PB10,GPIO_AF8
#define LPUART1_RX_PC0_ PC0,GPIO_AF8
#define _LPUART1_RX_PA3_ 1
#define _LPUART1_RX_PB10_ 1
#define _LPUART1_RX_PC0_ 1

#define LPUART1_TX_PA2_ PA2,GPIO_AF8
#define LPUART1_TX_PB11_ PB11,GPIO_AF8
#define LPUART1_TX_PC1_ PC1,GPIO_AF8
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB11_ 1
#define _LPUART1_TX_PC1_ 1

#define QUADSPI_BK1_IO0_PB1_ PB1,GPIO_AF10
#define _QUADSPI_BK1_IO0_PB1_ 1

#define QUADSPI_BK1_IO1_PB0_ PB0,GPIO_AF10
#define _QUADSPI_BK1_IO1_PB0_ 1

#define QUADSPI_BK1_IO2_PA7_ PA7,GPIO_AF10
#define _QUADSPI_BK1_IO2_PA7_ 1

#define QUADSPI_BK1_IO3_PA6_ PA6,GPIO_AF10
#define _QUADSPI_BK1_IO3_PA6_ 1

#define QUADSPI_BK1_NCS_PA2_ PA2,GPIO_AF10
#define QUADSPI_BK1_NCS_PB11_ PB11,GPIO_AF10
#define _QUADSPI_BK1_NCS_PA2_ 1
#define _QUADSPI_BK1_NCS_PB11_ 1

#define QUADSPI_CLK_PA3_ PA3,GPIO_AF10
#define QUADSPI_CLK_PB10_ PB10,GPIO_AF10
#define _QUADSPI_CLK_PA3_ 1
#define _QUADSPI_CLK_PB10_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_PA8_ 1

#define RTC_OUT2_PB2_ PB2,GPIO_AF0
#define _RTC_OUT2_PB2_ 1

#define RTC_OUT_ALARM_PB2_ PB2,GPIO_AF0
#define _RTC_OUT_ALARM_PB2_ 1

#define RTC_OUT_CALIB_PB2_ PB2,GPIO_AF0
#define _RTC_OUT_CALIB_PB2_ 1

#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PB15_ 1

#define SPI1_MISO_PA11_ PA11,GPIO_AF5
#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF5
#define _SPI1_MISO_PA11_ 1
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4 (NJTRST)_ 1

#define SPI1_MOSI_PA12_ PA12,GPIO_AF5
#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define _SPI1_MOSI_PA12_ 1
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1

#define SPI1_NSS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define SPI1_NSS_PB0_ PB0,GPIO_AF5
#define _SPI1_NSS_PA15 (JTDI)_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PB0_ 1

#define SPI1_SCK_PA1_ PA1,GPIO_AF5
#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF5
#define _SPI1_SCK_PA1_ 1
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3 (JTDO/TRACESWO)_ 1

#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define SPI2_MISO_PC2_ PC2,GPIO_AF5
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1

#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define SPI2_MOSI_PC3_ PC3,GPIO_AF5
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC3_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PB9_ 1

#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB13_ 1

#define SYS_JTCK-SWCLK_PA14 (JTCK/SWCLK)_ PA14 (JTCK/SWCLK),GPIO_AF0
#define _SYS_JTCK-SWCLK_PA14 (JTCK/SWCLK)_ 1

#define SYS_JTDI_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF0
#define _SYS_JTDI_PA15 (JTDI)_ 1

#define SYS_JTDO-SWO_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF0
#define _SYS_JTDO-SWO_PB3 (JTDO/TRACESWO)_ 1

#define SYS_JTMS-SWDIO_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF0
#define _SYS_JTMS-SWDIO_PA13 (JTMS/SWDIO)_ 1

#define SYS_JTRST_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF0
#define _SYS_JTRST_PB4 (NJTRST)_ 1

#define SYS_TRACECLK_PB7_ PB7,GPIO_AF0
#define SYS_TRACECLK_PC0_ PC0,GPIO_AF0
#define _SYS_TRACECLK_PB7_ 1
#define _SYS_TRACECLK_PC0_ 1

#define SYS_TRACED0_PB0_ PB0,GPIO_AF0
#define SYS_TRACED0_PC1_ PC1,GPIO_AF0
#define _SYS_TRACED0_PB0_ 1
#define _SYS_TRACED0_PC1_ 1

#define SYS_TRACED1_PB1_ PB1,GPIO_AF0
#define SYS_TRACED1_PC10_ PC10,GPIO_AF0
#define _SYS_TRACED1_PB1_ 1
#define _SYS_TRACED1_PC10_ 1

#define SYS_TRACED2_PB5_ PB5,GPIO_AF0
#define SYS_TRACED2_PD2_ PD2,GPIO_AF0
#define _SYS_TRACED2_PB5_ 1
#define _SYS_TRACED2_PD2_ 1

#define SYS_TRACED3_PB6_ PB6,GPIO_AF0
#define SYS_TRACED3_PC12_ PC12,GPIO_AF0
#define _SYS_TRACED3_PB6_ 1
#define _SYS_TRACED3_PC12_ 1

#define TIM15_BKIN_PA9_ PA9,GPIO_AF14
#define TIM15_BKIN_PB12_ PB12,GPIO_AF14
#define _TIM15_BKIN_PA9_ 1
#define _TIM15_BKIN_PB12_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF14
#define TIM15_CH1_PB14_ PB14,GPIO_AF14
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PB14_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF14
#define TIM15_CH1N_PB13_ PB13,GPIO_AF14
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PB13_ 1

#define TIM15_CH2_PA3_ PA3,GPIO_AF14
#define TIM15_CH2_PB15_ PB15,GPIO_AF14
#define _TIM15_CH2_PA3_ 1
#define _TIM15_CH2_PB15_ 1

#define TIM16_BKIN_PB5_ PB5,GPIO_AF14
#define _TIM16_BKIN_PB5_ 1

#define TIM16_CH1_PA6_ PA6,GPIO_AF14
#define TIM16_CH1_PB8_ PB8,GPIO_AF14
#define _TIM16_CH1_PA6_ 1
#define _TIM16_CH1_PB8_ 1

#define TIM16_CH1N_PB6_ PB6,GPIO_AF14
#define _TIM16_CH1N_PB6_ 1

#define TIM1_BKIN_PA6_ PA6,GPIO_AF1
#define TIM1_BKIN_PB12_ PB12,GPIO_AF1
#define _TIM1_BKIN_PA6_ 1
#define _TIM1_BKIN_PB12_ 1

#define TIM1_BKIN2_PA11_ PA11,GPIO_AF2
#define _TIM1_BKIN2_PA11_ 1

#define TIM1_BKIN2_COMP1_PA11_ PA11,GPIO_AF12
#define _TIM1_BKIN2_COMP1_PA11_ 1

#define TIM1_CH1_PA8_ PA8,GPIO_AF1
#define _TIM1_CH1_PA8_ 1

#define TIM1_CH1N_PA7_ PA7,GPIO_AF1
#define TIM1_CH1N_PB13_ PB13,GPIO_AF1
#define _TIM1_CH1N_PA7_ 1
#define _TIM1_CH1N_PB13_ 1

#define TIM1_CH2_PA9_ PA9,GPIO_AF1
#define _TIM1_CH2_PA9_ 1

#define TIM1_CH2N_PB0_ PB0,GPIO_AF1
#define TIM1_CH2N_PB14_ PB14,GPIO_AF1
#define _TIM1_CH2N_PB0_ 1
#define _TIM1_CH2N_PB14_ 1

#define TIM1_CH3_PA10_ PA10,GPIO_AF1
#define _TIM1_CH3_PA10_ 1

#define TIM1_CH3N_PB1_ PB1,GPIO_AF1
#define TIM1_CH3N_PB15_ PB15,GPIO_AF1
#define _TIM1_CH3N_PB1_ 1
#define _TIM1_CH3N_PB15_ 1

#define TIM1_CH4_PA11_ PA11,GPIO_AF1
#define _TIM1_CH4_PA11_ 1

#define TIM1_ETR_PA12_ PA12,GPIO_AF1
#define _TIM1_ETR_PA12_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15 (JTDI)_ 1
#define _TIM2_CH1_PA5_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF1
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3 (JTDO/TRACESWO)_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PB10_ PB10,GPIO_AF1
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PB10_ 1

#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define TIM2_CH4_PB11_ PB11,GPIO_AF1
#define _TIM2_CH4_PA3_ 1
#define _TIM2_CH4_PB11_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF14
#define TIM2_ETR_PA0_ PA0,GPIO_AF14
#define TIM2_ETR_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF2
#define TIM2_ETR_PA5_ PA5,GPIO_AF2
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15 (JTDI)_ 1
#define _TIM2_ETR_PA5_ 1

#define TSC_G1_IO1_PB12_ PB12,GPIO_AF9
#define _TSC_G1_IO1_PB12_ 1

#define TSC_G1_IO2_PB13_ PB13,GPIO_AF9
#define _TSC_G1_IO2_PB13_ 1

#define TSC_G1_IO3_PB14_ PB14,GPIO_AF9
#define _TSC_G1_IO3_PB14_ 1

#define TSC_G1_IO4_PB15_ PB15,GPIO_AF9
#define _TSC_G1_IO4_PB15_ 1

#define TSC_G2_IO1_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF9
#define _TSC_G2_IO1_PB4 (NJTRST)_ 1

#define TSC_G2_IO2_PB5_ PB5,GPIO_AF9
#define _TSC_G2_IO2_PB5_ 1

#define TSC_G2_IO3_PB6_ PB6,GPIO_AF9
#define _TSC_G2_IO3_PB6_ 1

#define TSC_G2_IO4_PB7_ PB7,GPIO_AF9
#define _TSC_G2_IO4_PB7_ 1

#define TSC_G3_IO1_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF9
#define _TSC_G3_IO1_PA15 (JTDI)_ 1

#define TSC_G3_IO2_PC10_ PC10,GPIO_AF9
#define _TSC_G3_IO2_PC10_ 1

#define TSC_G3_IO3_PC11_ PC11,GPIO_AF9
#define _TSC_G3_IO3_PC11_ 1

#define TSC_G3_IO4_PC12_ PC12,GPIO_AF9
#define _TSC_G3_IO4_PC12_ 1

#define TSC_G4_IO1_PC6_ PC6,GPIO_AF9
#define _TSC_G4_IO1_PC6_ 1

#define TSC_G4_IO2_PC7_ PC7,GPIO_AF9
#define _TSC_G4_IO2_PC7_ 1

#define TSC_G4_IO3_PC8_ PC8,GPIO_AF9
#define _TSC_G4_IO3_PC8_ 1

#define TSC_G4_IO4_PC9_ PC9,GPIO_AF9
#define _TSC_G4_IO4_PC9_ 1

#define TSC_SYNC_PB10_ PB10,GPIO_AF9
#define TSC_SYNC_PD2_ PD2,GPIO_AF9
#define _TSC_SYNC_PB10_ 1
#define _TSC_SYNC_PD2_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define UART1_CK_PB5_ PB5,GPIO_AF7
#define _UART1_CK_PA8_ 1
#define _UART1_CK_PB5_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define UART1_CTS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF7
#define _UART1_CTS_PA11_ 1
#define _UART1_CTS_PB4 (NJTRST)_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define UART1_DE_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF7
#define _UART1_DE_PA12_ 1
#define _UART1_DE_PB3 (JTDO/TRACESWO)_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define UART1_RTS_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF7
#define _UART1_RTS_PA12_ 1
#define _UART1_RTS_PB3 (JTDO/TRACESWO)_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF7
#define _UART2_CK_PA4_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF7
#define UART2_CTS_PA0_ PA0,GPIO_AF7
#define _UART2_CTS_PA0_ 1
#define _UART2_CTS_PA0_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF7
#define _UART2_DE_PA1_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF7
#define _UART2_RTS_PA1_ 1

#define UART2_RX_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF3
#define UART2_RX_PA3_ PA3,GPIO_AF7
#define _UART2_RX_PA15 (JTDI)_ 1
#define _UART2_RX_PA3_ 1

#define UART2_TX_PA2_ PA2,GPIO_AF7
#define _UART2_TX_PA2_ 1

#define UART3_CK_PB0_ PB0,GPIO_AF7
#define UART3_CK_PB12_ PB12,GPIO_AF7
#define UART3_CK_PC12_ PC12,GPIO_AF7
#define _UART3_CK_PB0_ 1
#define _UART3_CK_PB12_ 1
#define _UART3_CK_PC12_ 1

#define UART3_CTS_PA6_ PA6,GPIO_AF7
#define UART3_CTS_PB13_ PB13,GPIO_AF7
#define _UART3_CTS_PA6_ 1
#define _UART3_CTS_PB13_ 1

#define UART3_DE_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF7
#define UART3_DE_PB1_ PB1,GPIO_AF7
#define UART3_DE_PB14_ PB14,GPIO_AF7
#define UART3_DE_PD2_ PD2,GPIO_AF7
#define _UART3_DE_PA15 (JTDI)_ 1
#define _UART3_DE_PB1_ 1
#define _UART3_DE_PB14_ 1
#define _UART3_DE_PD2_ 1

#define UART3_RTS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF7
#define UART3_RTS_PB1_ PB1,GPIO_AF7
#define UART3_RTS_PB14_ PB14,GPIO_AF7
#define UART3_RTS_PD2_ PD2,GPIO_AF7
#define _UART3_RTS_PA15 (JTDI)_ 1
#define _UART3_RTS_PB1_ 1
#define _UART3_RTS_PB14_ 1
#define _UART3_RTS_PD2_ 1

#define UART3_RX_PB11_ PB11,GPIO_AF7
#define UART3_RX_PC11_ PC11,GPIO_AF7
#define UART3_RX_PC5_ PC5,GPIO_AF7
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PC11_ 1
#define _UART3_RX_PC5_ 1

#define UART3_TX_PB10_ PB10,GPIO_AF7
#define UART3_TX_PC10_ PC10,GPIO_AF7
#define UART3_TX_PC4_ PC4,GPIO_AF7
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PC4_ 1

#define UART4_CTS_PA6_ PA6,GPIO_AF8
#define UART4_CTS_PB13_ PB13,GPIO_AF8
#define _UART4_CTS_PA6_ 1
#define _UART4_CTS_PB13_ 1

#define UART4_DE_PB1_ PB1,GPIO_AF8
#define UART4_DE_PB12_ PB12,GPIO_AF8
#define _UART4_DE_PB1_ 1
#define _UART4_DE_PB12_ 1

#define UART4_RTS_PB1_ PB1,GPIO_AF8
#define UART4_RTS_PB12_ PB12,GPIO_AF8
#define _UART4_RTS_PB1_ 1
#define _UART4_RTS_PB12_ 1

#define UART4_RX_PA3_ PA3,GPIO_AF8
#define UART4_RX_PB10_ PB10,GPIO_AF8
#define UART4_RX_PC0_ PC0,GPIO_AF8
#define _UART4_RX_PA3_ 1
#define _UART4_RX_PB10_ 1
#define _UART4_RX_PC0_ 1

#define UART4_TX_PA2_ PA2,GPIO_AF8
#define UART4_TX_PB11_ PB11,GPIO_AF8
#define UART4_TX_PC1_ PC1,GPIO_AF8
#define _UART4_TX_PA2_ 1
#define _UART4_TX_PB11_ 1
#define _UART4_TX_PC1_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define USART1_CK_PB5_ PB5,GPIO_AF7
#define _USART1_CK_PA8_ 1
#define _USART1_CK_PB5_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define USART1_CTS_PB4 (NJTRST)_ PB4 (NJTRST),GPIO_AF7
#define _USART1_CTS_PA11_ 1
#define _USART1_CTS_PB4 (NJTRST)_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF7
#define USART1_DE_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF7
#define _USART1_DE_PA12_ 1
#define _USART1_DE_PB3 (JTDO/TRACESWO)_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define USART1_RTS_PB3 (JTDO/TRACESWO)_ PB3 (JTDO/TRACESWO),GPIO_AF7
#define _USART1_RTS_PA12_ 1
#define _USART1_RTS_PB3 (JTDO/TRACESWO)_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF7
#define USART1_RX_PB7_ PB7,GPIO_AF7
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1

#define USART1_TX_PA9_ PA9,GPIO_AF7
#define USART1_TX_PB6_ PB6,GPIO_AF7
#define _USART1_TX_PA9_ 1
#define _USART1_TX_PB6_ 1

#define USART2_CK_PA4_ PA4,GPIO_AF7
#define _USART2_CK_PA4_ 1

#define USART2_CTS_PA0_ PA0,GPIO_AF7
#define USART2_CTS_PA0_ PA0,GPIO_AF7
#define _USART2_CTS_PA0_ 1
#define _USART2_CTS_PA0_ 1

#define USART2_DE_PA1_ PA1,GPIO_AF7
#define _USART2_DE_PA1_ 1

#define USART2_RTS_PA1_ PA1,GPIO_AF7
#define _USART2_RTS_PA1_ 1

#define USART2_RX_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF3
#define USART2_RX_PA3_ PA3,GPIO_AF7
#define _USART2_RX_PA15 (JTDI)_ 1
#define _USART2_RX_PA3_ 1

#define USART2_TX_PA2_ PA2,GPIO_AF7
#define _USART2_TX_PA2_ 1

#define USART3_CK_PB0_ PB0,GPIO_AF7
#define USART3_CK_PB12_ PB12,GPIO_AF7
#define USART3_CK_PC12_ PC12,GPIO_AF7
#define _USART3_CK_PB0_ 1
#define _USART3_CK_PB12_ 1
#define _USART3_CK_PC12_ 1

#define USART3_CTS_PA6_ PA6,GPIO_AF7
#define USART3_CTS_PB13_ PB13,GPIO_AF7
#define _USART3_CTS_PA6_ 1
#define _USART3_CTS_PB13_ 1

#define USART3_DE_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF7
#define USART3_DE_PB1_ PB1,GPIO_AF7
#define USART3_DE_PB14_ PB14,GPIO_AF7
#define USART3_DE_PD2_ PD2,GPIO_AF7
#define _USART3_DE_PA15 (JTDI)_ 1
#define _USART3_DE_PB1_ 1
#define _USART3_DE_PB14_ 1
#define _USART3_DE_PD2_ 1

#define USART3_RTS_PA15 (JTDI)_ PA15 (JTDI),GPIO_AF7
#define USART3_RTS_PB1_ PB1,GPIO_AF7
#define USART3_RTS_PB14_ PB14,GPIO_AF7
#define USART3_RTS_PD2_ PD2,GPIO_AF7
#define _USART3_RTS_PA15 (JTDI)_ 1
#define _USART3_RTS_PB1_ 1
#define _USART3_RTS_PB14_ 1
#define _USART3_RTS_PD2_ 1

#define USART3_RX_PB11_ PB11,GPIO_AF7
#define USART3_RX_PC11_ PC11,GPIO_AF7
#define USART3_RX_PC5_ PC5,GPIO_AF7
#define _USART3_RX_PB11_ 1
#define _USART3_RX_PC11_ 1
#define _USART3_RX_PC5_ 1

#define USART3_TX_PB10_ PB10,GPIO_AF7
#define USART3_TX_PC10_ PC10,GPIO_AF7
#define USART3_TX_PC4_ PC4,GPIO_AF7
#define _USART3_TX_PB10_ 1
#define _USART3_TX_PC10_ 1
#define _USART3_TX_PC4_ 1

#define USB_DM_PA11_ PA11,GPIO_AF10
#define _USB_DM_PA11_ 1

#define USB_DP_PA12_ PA12,GPIO_AF10
#define _USB_DP_PA12_ 1

#define USB_NOE_PA13 (JTMS/SWDIO)_ PA13 (JTMS/SWDIO),GPIO_AF10
#define USB_NOE_PC9_ PC9,GPIO_AF10
#define _USB_NOE_PA13 (JTMS/SWDIO)_ 1
#define _USB_NOE_PC9_ 1

#endif /* LOWLEVEL_INCLUDE_DEVICE_ALTERNATE_FUNCTION */